[
  {
    "achievements": [
      "Worked in the development of digital acquisitions experiences for large financial institutions in Brazil, such as Itaú and Picpay, with focus on SEO performance, scalability and great user experience.",
      "Worked in the development of multiple applications for large college institutions in Brazil, with performative static sites generation (SSG), scalable CMS integrations on a multi-brand UI ecosystem, using NetxJS and yarn workspaces on a monorepo environment.",
      "Worked in the development of an A/B testing tool, integrating event monitoring using New Relic for experience performance based on the testing business rules.",
      "Worked in the implementation for CI/CD process using GitHub Actions and deploy notifications on Notion and Slacks channels.",
      "Crafted multiple design systems libraries for partners brands, using Vite, React, Typescript and SCSS, with application of accessibility best practices (A11y) using E2E tests and unit tests with Cypress, Testing Library, Jest and Vitest.",
      "Played a lead role in the implementation of new frameworks such as Astro for multi-brand static pages, focusing on high performative SEO and page load scores.",
      "Played a lead role in the development of a focused email tool and platform to improve our marketing campaigns using collected data from 3rd party tools like Google Tag Manager and Facebook Pixel.",
      "Played a lead role in the implementation of best practices for a developer experience documentation across projects and DevOps process, using GitHub Wiki, GitHub Projects and Astro Starlight.",
      "Mentored and helped to create careers roadmaps for Juniors peers, following their projects achievements and creating safe spaces to improve hard and soft skills during 1:1s and team meetings."
    ],
    "company": "R2 Ventures",
    "role": "Lead Front-end Developer",
    "year": "2022 - currently"
  },
  {
    "achievements": [
      "Desenvolvimento de plataforma de cotação de materiais de construção com foco em pequenas obras para casas e comércios.",
      "Coordenei a migração de tecnologia legada e defasada em Angular, otimizando a utilização de Angular Universal para SSR.",
      "Coordenei a criação e otimização de um novo Design System e implementei melhorias nas requisições desnecessárias da API, impactando consideravelmente o SEO das páginas.",
      "Realizei, junto ao time de design, processos de pesquisa comparativa de experiência do usuário e otimização de fluxo de cotação.",
      "Auxiliei o time com documentação técnica, otimizando a rotina de PR e uso do Azure Wiki para centralizar processos e acompanhar a evolução da aplicação."
    ],
    "company": "Construmarket",
    "role": "Front-end Developer",
    "year": "2021 - 2022"
  },
  {
    "achievements": [
      "Design e desenvolvimento de dashboards para acompanhamento de entregas, gamificação e atuação de colaboradores para a Pepsico, utilizando VueJS, SCSS e PHP.",
      "Design e desenvolvimento de plataforma de serviços de videomensagens com celebridades (projeto descontinuado), utilizando VueJS, SCSS e PHP.",
      "Design e desenvolvimento de biblioteca de gráficos para VueJS com animações CSS em objetos SVG.",
      "Design e desenvolvimento de aplicações de relatórios interativos com foco em campanhas de autoajuda e rotina saudável, utilizando VueJS, SCSS e API REST."
    ],
    "company": "Hive Solutions Cloud System",
    "role": "Front-end Developer / UI Designer",
    "year": "2020 - 2021"
  },
  {
    "achievements": [
      "Desenvolvimento e otimização de campanhas de e-mail marketing com MJML e landing pages de eventos para PayPal e João Rock.",
      "Desenvolvimento de aplicações B2C para marketing de leads e aquisição no setor automotivo para a Mercedes-Benz.",
      "Desenvolvimento de SaaS para administração de contas e eventos no setor de condomínios.",
      "Desenvolvimento de portais para acompanhamento em tempo real de viagens, serviços e produtos para o aeroporto de Florianópolis.",
      "Design e desenvolvimento de intranet com integração multiusuário para o Banco BMG."
    ],
    "company": "Tesla Tecnologia e Comunicação",
    "role": "Jr. Front-end Developer",
    "year": "2017 - 2020"
  }
]
