[
  {
    "achievements": [
      "Worked in the development of digital acquisitions experiences for large financial institutions in Brazil, such as Itaú and Picpay, with focus on SEO performance, scalability and great user experience.",
      "Worked in the development of multiple applications for large college institutions in Brazil, with performative static sites generation (SSG), scalable CMS integrations on a multi-brand UI ecosystem, using NetxJS and yarn workspaces on a monorepo environment.",
      "Worked in the development of an A/B testing tool, integrating event monitoring using New Relic for experience performance based on the testing business rules.",
      "Worked in the implementation for CI/CD process using GitHub Actions and deploy notifications on Notion and Slacks channels.",
      "Crafted multiple design systems libraries for partners brands, using Vite, React, Typescript and SCSS, with application of accessibility best practices (A11y) using E2E tests and unit tests with Cypress, Testing Library, Vitest and Storybook.",
      "Played a lead role in the implementation of new frameworks such as Astro for multi-brand static pages, focusing on high performative SEO and page load scores.",
      "Played a lead role in the development of a focused email tool and platform to improve our marketing campaigns using collected data from 3rd party tools like Google Tag Manager and Facebook Pixel.",
      "Played a lead role in the implementation of best practices for a developer experience documentation across projects and DevOps process, using GitHub Wiki, GitHub Projects and Astro Starlight.",
      "Mentored and helped to create careers roadmaps for Juniors peers, following their projects achievements and creating safe spaces to improve hard and soft skills during 1:1s and team meetings."
    ],
    "company": "R2 Ventures",
    "role": "Lead Front-end Developer",
    "year": "2022 - currently"
  },
  {
    "achievements": [
      "Worked in the development of multiple e-commerce experiences for building materials with focus on home and small business projects, using Angular Universal, Typescript, Axios and SCSS, focusing on the best practices for SEO and accessibility (A11y).",
      "Worked on the development of a management application for large-scale building projects, such as malls, hospitals, and convention centers, with a focus on improving communication with the engineering team, suppliers, and inventory.",
      "Crafted a roadmap tool to help DIY workers to start small home projects, recommending better materials offers for the quantity needed for the project.",
      "Played a lead role to improve SEO performance across multiple projects for the company.",
      "Played a lead role to develop the new design system using Angular, Typescript and SCSS and user experience for the cross-sell services of the company across our partners brand.",
      "Played a lead role at the implementation of the developer experience and main CI/CD process documentation for the front-end team using Azure Wiki."
    ],
    "company": "Construmarket",
    "role": "Front-end Developer",
    "year": "2021 - 2022"
  },
  {
    "achievements": [
      "Worked as UI designer and main developer for a multi brand application with focus on inventory status for mini markets and gas stations for PepsiCo, improving monitoring on re-stock deliveries and drivers goals. Developed with Vue.js, SCSS and Laravel.",
      "Worked as main developer on a custom Vue.js graph library to handle dynamic data and improve better performance on heavy load dashboards graphs using SVG and SVG Animations.",
      "Worked in the development of a video gifts app, where users could purchase birthday messages for relatives from Brazilian movie stars, soap operas actors and pop celebrities. Developed with HTML, jQuery, Axios, SCSS and Laravel."
    ],
    "company": "Hive Solutions Cloud System",
    "role": "Front-end Developer / UI Designer",
    "year": "2020 - 2021"
  },
  {
    "achievements": [
      "Worked as main developer on the improvement of email marketing campaigns, developing a custom MJML tool to speed up the template creation of multi-brand emails, using bootstrap and jQuery.",
      "Worked as main developer for an application to help landlords and building management companies to manage their ventures, using Vue.js, Axios, LESS and Bootstrap.",
      "Worked in the development of landing pages with focus on e-commerce campaigns and promotions for brands like PayPal, Carrefour and Mercedes-Benz, using Bootstrap, jQuery, Axios and LESS.",
      "Worked in the development of landing pages for B2C credit lines on the acquisition of new trucks for Mercedes-Benz stores in Brazil, with Bootstrap, jQuery and LESS.",
      "Worked in the development of the main app for flying tracking and airport services for Florianópolis (Brazil) airport."
    ],
    "company": "Tesla Tecnologia e Comunicação",
    "role": "Jr. Front-end Developer",
    "year": "2017 - 2020"
  }
]
