[
  {
    "achievements": [
      "Desenvolvi o design system para o Banco Itaú utilizando React, TypeScript e SCSS, impactando múltiplas aplicações de aquisição digital de serviços.",
      "Implementei o Storybook e criei documentações para uso de componentes, hooks e utils desenvolvidos pelo time.",
      "Desenvolvi aplicações de aquisição digital de cursos EAD para o grupo Cogna, com projetos em Next.js, Yarn Workspace, SCSS e CMS com Storyblok.",
      "Desenvolvi aplicação de aquisição de leads para o grupo XP Investimentos através de campanhas de conteúdo educativo sobre o setor financeiro, utilizando Astro, React, SCSS e Storyblok.",
      "Desenvolvi uma ferramenta de email marketing focada na criação e otimização de campanhas, facilitando a administração dos times e o gerenciamento de mais de 1 milhão de emails mensais. Utilizei Gatsby e SCSS.",
      "Desenvolvi bibliotecas de tracking para realização de testes A/B e monitoramento de fluxo de usuários, utilizando React e NodeJS para API.",
      "Implementei melhorias de acessibilidade e SEO nos projetos, ajudando as equipes a alcançar as melhores práticas para os projetos de parceiros.",
      "Contribuí para a criação e cultura de boas práticas de documentação técnica com Github Wiki, Github Projects, Bruno e Notion.",
      "Utilizei Jest e Vitest para testes unitários, Cypress e Playwright para E2E e Github Actions para CI/CD.",
      "Implementei o New Relic para monitoramento de eventos, fluxos e alertas de bugs em produção.",
      "Orientei a carreira de colegas, acompanhando a rotina de desenvolvimento individual de profissionais júnior e auxiliando na criação de roadmaps de estudos.",
      "Organizei eventos culturais na empresa, como Code in the Dark, apresentações de conteúdos técnicos e Hackathons."
    ],
    "company": "R2 Ventures",
    "role": "Desenvolvedor Front-end Senior",
    "year": "2022 - atual"
  },
  {
    "achievements": [
      "Desenvolvimento de plataforma de cotação de materiais de construção com foco em pequenas obras para casas e comércios.",
      "Coordenei a migração de tecnologia legada e defasada em Angular, otimizando a utilização de Angular Universal para SSR.",
      "Coordenei a criação e otimização de um novo Design System e implementei melhorias nas requisições desnecessárias da API, impactando consideravelmente o SEO das páginas.",
      "Realizei, junto ao time de design, processos de pesquisa comparativa de experiência do usuário e otimização de fluxo de cotação.",
      "Auxiliei o time com documentação técnica, otimizando a rotina de PR e uso do Azure Wiki para centralizar processos e acompanhar a evolução da aplicação."
    ],
    "company": "Construmarket",
    "role": "Desenvolvedor Front-end Pleno",
    "year": "2021 - 2021"
  },
  {
    "achievements": [
      "Design e desenvolvimento de dashboards para acompanhamento de entregas, gamificação e atuação de colaboradores para a Pepsico, utilizando VueJS, SCSS e PHP.",
      "Design e desenvolvimento de plataforma de serviços de videomensagens com celebridades (projeto descontinuado), utilizando VueJS, SCSS e PHP.",
      "Design e desenvolvimento de biblioteca de gráficos para VueJS com animações CSS em objetos SVG.",
      "Design e desenvolvimento de aplicações de relatórios interativos com foco em campanhas de autoajuda e rotina saudável, utilizando VueJS, SCSS e API REST."
    ],
    "company": "Hive Solutions Cloud System",
    "role": "Desenvolvedor Front-end Pleno / Designer",
    "year": "2020 - 2020"
  },
  {
    "achievements": [
      "Desenvolvimento e otimização de campanhas de e-mail marketing com MJML e landing pages de eventos para PayPal e João Rock.",
      "Desenvolvimento de aplicações B2C para marketing de leads e aquisição no setor automotivo para a Mercedes-Benz.",
      "Desenvolvimento de SaaS para administração de contas e eventos no setor de condomínios.",
      "Desenvolvimento de portais para acompanhamento em tempo real de viagens, serviços e produtos para o aeroporto de Florianópolis.",
      "Design e desenvolvimento de intranet com integração multiusuário para o Banco BMG."
    ],
    "company": "Tesla Tecnologia e Comunicação",
    "role": "Desenvolvedor Front-end Junior",
    "year": "2017 - 2020"
  }
]
